import React from 'react';
import './EligibilityPage.css';
import Navbar from '../components/Navbar';

function EligibilityPage() {
  return (
      <>
          <Navbar />
    <div className="eligibility-page">
      <h2>Κριτήρια Επιλεξιμότητας</h2>

      <div className="criteria-section">
        <h3>Για Γονείς/Κηδεμόνες:</h3>
        <ul>
          <li>Πρέπει να είναι νόμιμος κηδεμόνας ή γονέας ενός παιδιού που χρειάζεται φροντίδα.</li>
          <li>Πρέπει να συμφωνεί με τους όρους της πλατφόρμας.</li>
          <li>Πρέπει να είναι σε θέση να πληρώσει για τις υπηρεσίες (μέσω κουπονιών, όπως εφαρμόζεται στην περίπτωσή μας).</li>
          <li>Πρέπει να έχει δημιουργήσει λογαριασμό.</li>
        </ul>
      </div>

      <div className="criteria-section">
        <h3>Για Νταντάδες/Επαγγελματίες:</h3>
        <ul>
          <li>Πρέπει να είναι άνω των 18 ετών.</li>
          <li>Πρέπει να διαθέτει προσόντα ή εμπειρία στη φροντίδα παιδιών.</li>
          <li>Πρέπει να συμφωνεί με τους όρους της πλατφόρμας.</li>
          <li>Πρέπει να είναι εγγεγραμμένος χρήστης.</li>
        </ul>
      </div>
        <p>Εάν πληροίτε τις απαιτήσεις επιλεξιμότητας, μπορείτε να προχωρήσετε στην εγγραφή.</p>
    </div>
      </>
  );
}

export default EligibilityPage;
